src/cfe/api_query/Catalogs/pbi_запросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>pbi_запросы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХМЛ_Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХМЛ_Настройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаКлюч</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизволныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписейПотоков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество_Пар</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/api_query/CommonForms/ФормаНастроекОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ДополнитьПараметры_НаСервере(ДопПараметры)
		
	ЭтотОбъект.ВариантСсылка = Справочники.pbi_запросы.Вернуть_Вариант_поКлючу(КлючТекущегоВарианта);
	
	СКД	=	ПолучитьИзВременногоХранилища(ЭтотОбъект.НастройкиОтчета.АдресСхемы);
	ХМЛ_СКД = AQ_Модуль.ВернутьСхемуХМЛ_СКД(СКД);
	//1 вариант
	ХМЛ_СКД_настройки = AQ_Модуль.ВернутьСхемуХМЛ_СКД(КомпоновщикНастроек.ПолучитьНастройки());	
	//2 вариант когда не работает 1
	//ХМЛ_СКД_настройки = AQ_Модуль.ВернутьСхемуХМЛ_СКД(ЭтотОбъект.ВариантСсылка.Настройки.получить());
	
	АдресХранилищаХМЛ = ПоместитьВоВременноеХранилище(Новый Структура("ХМЛ_СКД,ХМЛ_СКД_настройки",ХМЛ_СКД,ХМЛ_СКД_настройки));
	
	ДопПараметры.Вставить("Транслит",AQ_Модуль.Транслит(ДопПараметры.Наименование));				
	ДопПараметры.Вставить("АдресХранилищаХМЛ",АдресХранилищаХМЛ);	
	
	НайденныйЗапрос = Справочники.pbi_запросы.Вернуть_Запрос_поИдентификатору(ДопПараметры.Транслит,ДопПараметры.Отчет);
	// найдем существующий элемент
	Если ЗначениеЗаполнено(НайденныйЗапрос) Тогда
		ДопПараметры.Вставить("Ключ",НайденныйЗапрос);
	КонецЕсли;		
	
КонецПроцедуры


&НаКлиенте
Процедура AQ_aq_ПеренестиВЗапросыПосле(Команда)
	
	ДопПараметры = Новый Структура("КлючТекущегоВарианта",ЭтотОбъект.КлючТекущегоВарианта);
	ДопПараметры.Вставить("Наименование",ЭтотОбъект.ВариантНаименование);
	ДопПараметры.Вставить("Отчет",Истина);
	ДопПараметры.Вставить("Заполнить",Истина);
	ДополнитьПараметры_НаСервере(ДопПараметры);
	ОткрытьФорму("Справочник.pbi_запросы.Форма.ФормаЭлемента",ДопПараметры,ЭтаФорма,ДопПараметры.Наименование);	
	
КонецПроцедуры
